DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
#include <Arduino.h>
#include <DNSServer.h>
#include <EEPROM.h>
#include <ESP8266WebServer.h>
#include <ESP8266WiFi.h>
#include <WiFiUdp.h>
#include <LittleFS.h>
#include <Updater.h>

#include "../../firmware_shared/app_runtime.h"
#include "../../firmware_shared/app_transport.h"
#include "../../firmware_shared/theme_spec_renderer_core.h"
#include "boot_recovery_policy.h"
#include "gif_asset_validator_file.h"
#include "renderer_esp8266.h"
#include "wifi_setup_portal.h"

#ifndef CODEXBAR_DISPLAY_BOARD_ID
#define CODEXBAR_DISPLAY_BOARD_ID "esp8266-unknown"
#endif

#ifndef CODEXBAR_DISPLAY_FW_VERSION
#define CODEXBAR_DISPLAY_FW_VERSION "dev"
#endif

#if CODEXBAR_DISPLAY_THEME_SPEC_RENDERER
const char kThemeFeatureJSON[] = "[\"theme-spec-v1\"]";
#else
const char kThemeFeatureJSON[] = "[]";
#endif

namespace {

codexbar_display::app::RuntimeContext runtimeCtx;
codexbar_display::esp8266::RendererESP8266 renderer;
ESP8266WebServer webServer(80);
WiFiServer rawOtaServer(8081);
DNSServer dnsServer;

constexpr int kMaxFrameBytes = 2048;
constexpr uint16_t kDnsPort = 53;
constexpr uint32_t kWifiCredsMagic = 0x56544231UL;  // VTB1
constexpr uint32_t kBootRecoveryMagic = 0x56544252UL;  // VTBR
constexpr uint32_t kBootDiagnosticsMagic = 0x56544244UL;  // VTBD
constexpr size_t kWifiSsidBytes = 33;
constexpr size_t kWifiPasswordBytes = 65;
constexpr size_t kWifiCredsBytes = 4 + kWifiSsidBytes + kWifiPasswordBytes;
constexpr size_t kBootRecoveryOffset = kWifiCredsBytes;
constexpr size_t kBootRecoveryBytes = 6;
constexpr size_t kBootRecoveryCounterOffset = kBootRecoveryOffset + 4;
constexpr size_t kBootRecoveryUploadOffset = kBootRecoveryOffset + 5;
constexpr size_t kBootDiagnosticsOffset = kBootRecoveryOffset + kBootRecoveryBytes;
constexpr size_t kBootDiagnosticsBytes = 8;
constexpr size_t kBootResetCounterOffset = kBootDiagnosticsOffset + 4;
constexpr size_t kEepromBytes = kWifiCredsBytes + kBootRecoveryBytes + kBootDiagnosticsBytes;
constexpr unsigned long kWifiConnectTimeoutMs = 20000UL;
constexpr unsigned long kWifiReconnectRetryMs = 5000UL;
constexpr unsigned long kWifiReconnectFallbackMs = 120000UL;
constexpr unsigned long kRebootDelayMs = 750UL;
constexpr unsigned long kBootRecoveryStableMs = 30000UL;
constexpr unsigned long kFrameStaleWarningMs = 150000UL;
constexpr unsigned long kFirmwareUpdateNoticeToggleMs = 1500UL;
constexpr unsigned long kRawOtaProgressTimeoutMs = 30000UL;
constexpr size_t kRawOtaReadBufferBytes = 512;
constexpr uint8_t kBootRecoveryThreshold = 3;
constexpr uint8_t kBootRecoveryUploadMarker = 0xA5;
constexpr size_t kMaxAssetPathBytes = 32;
constexpr size_t kMaxStoredThemeSpecBytes = 4096;
constexpr size_t kMaxThemeGifAssetBytes = codexbar_display::themespec::kMaxThemeSpecGifAssetBytes;
constexpr uint8_t kDefaultBrightnessPercent = 100;
constexpr uint8_t kMinBrightnessPercent = 10;
constexpr uint8_t kMaxBrightnessPercent = 100;
const char kSetupApSsid[] = "VibeTV-Setup";
const char kSetupAddress[] = "192.168.4.1";
const char kCustomerAppHost[] = "app.vibetv.shop";
const char kCustomerAppUrl[] = "https://app.vibetv.shop";
const char kDeviceSettingsPath[] = "/s";
const char kDeviceAuthTokenPath[] = "/auth";
const char kActiveThemeSpecPathFile[] = "/theme-active";
const char kAssetUploadTemporaryPath[] = "/.asset-upload.tmp";
const char kDeviceAuthHeader[] = "X-VibeTV-Token";
const char kFirmwareManifestUrl[] = "https://github.com/DreamyTalesPAN/CodexBar-Display/releases/latest/download/firmware-manifest.json";
#ifdef CODEXBAR_DISPLAY_WIFI_SUPPORT_URL
const char kWifiTroubleshootingUrl[] = CODEXBAR_DISPLAY_WIFI_SUPPORT_URL;
#else
const char* const kWifiTroubleshootingUrl = nullptr;
#endif
constexpr uint8_t kFirmwareUpdateNoticeTextCount = 3;
constexpr uint8_t kFirmwareUpdateNoticeProviderPhase = 0;
constexpr uint8_t kFirmwareUpdateNoticeAvailablePhase = 1;
constexpr uint8_t kFirmwareUpdateNoticeAppPhase = 2;

String themeCapabilitiesJSON(bool enabled, bool compact = false) {
  String out;
  out.reserve(compact ? 180 : 260);
  if (!enabled) {
    return "{\"supportsThemeSpecV1\":false,\"maxThemeSpecBytes\":0,\"maxThemePrimitives\":0}";
  }
  out += "{\"supportsThemeSpecV1\":true,\"maxThemeSpecBytes\":2048,\"maxThemePrimitives\":";
  out += String(codexbar_display::themespec::kMaxCompiledThemeSpecPrimitives);
  if (!compact) {
    out += ",\"supportedPrimitiveTypes\":[\"text\",\"rect\",\"progress\",\"gif\",\"sprite\",\"pixels\"]";
    out += ",\"supportsStoredThemes\":true";
  }
  out += ",\"maxStoredThemeSpecBytes\":";
  out += String(kMaxStoredThemeSpecBytes);
  out += ",\"maxThemeGifAssets\":";
  out += String(codexbar_display::themespec::kMaxThemeSpecGifAssets);
  out += ",\"maxThemeGifBytes\":";
  out += String(codexbar_display::themespec::kMaxThemeSpecGifAssetBytes);
  out += ",\"maxThemeGifWidth\":";
  out += String(codexbar_display::themespec::kMaxThemeSpecGifWidth);
  out += ",\"maxThemeGifHeight\":";
  out += String(codexbar_display::themespec::kMaxThemeSpecGifHeight);
  out += ",\"maxThemeGifPixels\":";
  out += String(codexbar_display::themespec::kMaxThemeSpecGifPixels);
  out += ",\"maxThemeGifLzwBits\":";
  out += String(codexbar_display::esp8266::kMaxThemeGifLzwBits);
  out += "}";
  return out;
}

struct WifiCredentials {
  char ssid[kWifiSsidBytes] = {0};
  char password[kWifiPasswordBytes] = {0};
};

struct WifiConnectAttempt {
  bool attempted = false;
  bool connected = false;
  String ssid;
  int status = WL_IDLE_STATUS;
};

struct FirmwareUpdateState {
  bool available = false;
  String latestVersion;
  String lastStatus = "disabled";
  String lastError;
  unsigned long lastCheckedAtMs = 0;
  unsigned long nextCheckAtMs = 0;
  bool noticeVisible = false;
  uint8_t noticePhase = 0;
  unsigned long noticeLastToggleAtMs = 0;
};

struct OtaUploadDiagnostics {
  const char* target = "none";
  const char* status = "idle";
  String filename;
  String lastError;
  int command = -1;
  size_t contentLength = 0;
  size_t totalSize = 0;
  size_t maxSize = 0;
  size_t freeSketchSpace = 0;
  uint8_t updateError = UPDATE_ERROR_OK;
  unsigned long startedAtMs = 0;
  unsigned long endedAtMs = 0;
  unsigned long successCount = 0;
  unsigned long failureCount = 0;
};

struct RuntimeRenderDiagnostics {
  unsigned long fullCount = 0;
  unsigned long partialCount = 0;
  unsigned long animatedTickAttempts = 0;
  const char* lastKind = "none";
  const char* lastFullKind = "none";
  const char* lastPartialKind = "none";
  unsigned long lastDurationUs = 0;
  unsigned long lastAtMs = 0;
};

struct DeviceSettings {
  uint8_t brightnessPercent = kDefaultBrightnessPercent;
};

