DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
uint8_t readBootRecoveryCounter() {
  EEPROM.begin(kEepromBytes);
  uint32_t magic = 0;
  EEPROM.get(kBootRecoveryOffset, magic);
  if (magic != kBootRecoveryMagic) {
    return 0;
  }
  return EEPROM.read(kBootRecoveryCounterOffset);
}

bool readBootRecoveryUploadActive() {
  EEPROM.begin(kEepromBytes);
  uint32_t magic = 0;
  EEPROM.get(kBootRecoveryOffset, magic);
  if (magic != kBootRecoveryMagic) {
    return false;
  }
  return EEPROM.read(kBootRecoveryUploadOffset) == kBootRecoveryUploadMarker;
}

void writeBootRecoveryState(uint8_t counter, bool uploadActive) {
  EEPROM.begin(kEepromBytes);
  EEPROM.put(kBootRecoveryOffset, kBootRecoveryMagic);
  EEPROM.write(kBootRecoveryCounterOffset, counter);
  EEPROM.write(kBootRecoveryUploadOffset, uploadActive ? kBootRecoveryUploadMarker : 0);
  EEPROM.commit();
}

void writeBootRecoveryCounter(uint8_t counter) {
  writeBootRecoveryState(counter, readBootRecoveryUploadActive());
}

void markBootRecoveryUploadActive(bool active) {
  const bool previous = readBootRecoveryUploadActive();
  if (previous == active) {
    return;
  }
  writeBootRecoveryState(readBootRecoveryCounter(), active);
}

void clearBootRecoveryCounter() {
  EEPROM.begin(kEepromBytes);
  for (size_t i = 0; i < kBootRecoveryBytes; ++i) {
    EEPROM.write(kBootRecoveryOffset + i, 0);
  }
  EEPROM.commit();
  bootRecoveryCounterNeedsClear = false;
  Serial.println("boot_recovery_counter_cleared");
}

uint32_t incrementBootResetCounter() {
  EEPROM.begin(kEepromBytes);
  uint32_t magic = 0;
  uint32_t counter = 0;
  EEPROM.get(kBootDiagnosticsOffset, magic);
  if (magic == kBootDiagnosticsMagic) {
    EEPROM.get(kBootResetCounterOffset, counter);
  }
  if (counter < 0xFFFFFFFFUL) {
    ++counter;
  }
  EEPROM.put(kBootDiagnosticsOffset, kBootDiagnosticsMagic);
  EEPROM.put(kBootResetCounterOffset, counter);
  EEPROM.commit();
  return counter;
}

bool consumeBootRecoveryTrigger() {
  if (readBootRecoveryUploadActive()) {
    clearBootRecoveryCounter();
    return false;
  }

  if (!codexbar_display::esp8266::BootRecoveryPolicy::CountsAsPhysicalReset(
          ESP.getResetInfoPtr()->reason)) {
    clearBootRecoveryCounter();
    return false;
  }

  uint8_t counter = readBootRecoveryCounter();
  if (counter < 255) {
    ++counter;
  }
  writeBootRecoveryCounter(counter);

  if (counter >= kBootRecoveryThreshold) {
    clearWifiCredentials();
    clearSdkWifiCredentials();
    clearBootRecoveryCounter();
    Serial.println("boot_recovery_triggered action=wifi_setup");
    drawWifiResetStatus("Starting setup");
    delay(1000);
    return true;
  }

  bootRecoveryCounterNeedsClear = true;
  bootRecoveryClearAtMs = millis() + kBootRecoveryStableMs;
  return false;
}

WifiConnectAttempt connectToSavedWifi(const WifiCredentials& creds) {
  WifiConnectAttempt result;
  result.attempted = true;
  result.ssid = creds.ssid;
  Serial.printf("wifi_connect ssid=%s\n", creds.ssid);
  drawWifiConnectingStatus(creds.ssid);
  WiFi.mode(WIFI_STA);
  WiFi.begin(creds.ssid, creds.password);

  const unsigned long startedAt = millis();
  while (WiFi.status() != WL_CONNECTED && (millis() - startedAt) < kWifiConnectTimeoutMs) {
    delay(250);
    Serial.print(".");
  }
  Serial.println();
  result.status = static_cast<int>(WiFi.status());

  if (WiFi.status() != WL_CONNECTED) {
    Serial.printf("wifi_connect_failed status=%d\n", result.status);
    return result;
  }

  Serial.printf("wifi_connected ssid=%s ip=%s\n", creds.ssid, WiFi.localIP().toString().c_str());
  drawWaitingForCompanionStatus();
  result.connected = true;
  return result;
}

WifiConnectAttempt connectToSdkWifiConfig(const String& alreadyAttemptedSsid = String()) {
  WifiConnectAttempt result;
  WiFi.mode(WIFI_STA);
  const String ssid = WiFi.SSID();
  if (ssid.length() == 0) {
    Serial.println("wifi_sdk_config_missing");
    return result;
  }
  if (alreadyAttemptedSsid.length() > 0 && ssid == alreadyAttemptedSsid) {
    Serial.printf("wifi_sdk_connect_skipped ssid=%s reason=already_attempted\n", ssid.c_str());
    return result;
  }

  result.attempted = true;
  result.ssid = ssid;
  Serial.printf("wifi_sdk_connect ssid=%s\n", ssid.c_str());
  drawWifiConnectingStatus(ssid);
  WiFi.begin();

  const unsigned long startedAt = millis();
  while (WiFi.status() != WL_CONNECTED && (millis() - startedAt) < kWifiConnectTimeoutMs) {
    delay(250);
    Serial.print(".");
  }
  Serial.println();
  result.status = static_cast<int>(WiFi.status());

  if (WiFi.status() != WL_CONNECTED) {
    Serial.printf("wifi_sdk_connect_failed status=%d\n", result.status);
    return result;
  }

  const String password = WiFi.psk();
  if (ssid.length() < kWifiSsidBytes && password.length() < kWifiPasswordBytes) {
    saveWifiCredentials(ssid, password);
    Serial.printf("wifi_sdk_credentials_imported ssid=%s\n", ssid.c_str());
  }

  Serial.printf("wifi_connected source=sdk ssid=%s ip=%s\n", ssid.c_str(), WiFi.localIP().toString().c_str());
  drawWaitingForCompanionStatus();
  result.connected = true;
  return result;
}

bool scanSetupNetworks() {
  using namespace codexbar_display::esp8266::wifi_setup;
  if (!BeginScan(setupWifiState)) {
    Serial.println("wifi_setup_scan_ignored reason=already_running");
    return false;
  }

  Serial.println("wifi_setup_scan_started");
  int networks = -2;
  WiFi.mode(setupMode ? WIFI_AP_STA : WIFI_STA);
  WiFi.disconnect(false);
  delay(150);

  for (int attempt = 1; attempt <= 2; ++attempt) {
    networks = WiFi.scanNetworks(false, true);
    if (networks > 0) {
      break;
    }
    Serial.printf("wifi_setup_scan_empty attempt=%d networks=%d\n", attempt, networks);
    WiFi.scanDelete();
    delay(250);
    yield();
  }

  for (int i = 0; i < networks; ++i) {
    AddScanResult(setupWifiState, WiFi.SSID(i), WiFi.RSSI(i), WiFi.channel(i));
  }
  WiFi.scanDelete();
  FinishScan(setupWifiState, networks);
  Serial.printf(
      "wifi_setup_scan_finished networks=%d visible=%u state=%u\n",
      networks,
      setupWifiState.networkCount,
      static_cast<unsigned int>(setupWifiState.scanStatus));
  return true;
}

String connectedPageHTML() {
  const String ip = WiFi.localIP().toString();
  const bool hasFrame = codexbar_display::app::HasFrame(runtimeCtx);

  String html;
  html.reserve(1500);
  html += F("<!doctype html><meta name=viewport content='width=device-width,initial-scale=1'><title>VibeTV</title><style>");
  html += F("body{font-family:-apple-system,BlinkMacSystemFont,Segoe UI,sans-serif;margin:24px;background:#0b0c0d;color:#f6f4ed}a{color:#c7ff00;font-weight:800}code,pre{background:#08090a;border:1px solid #30343a;padding:8px;display:block;white-space:pre-wrap;word-break:break-word}button,input{width:100%;font:inherit;margin-top:8px}button{padding:12px;background:#c7ff00;border:0;font-weight:900}section{border-top:1px solid #2b2f35;margin-top:16px;padding-top:12px}</style><h1>Vibe TV</h1>");
  html += F("<p>Connected<br><code>http://");
  html += ip;
  html += F("</code></p>");
  if (firmwareUpdate.available) {
    html += updateStatusHTML(true);
  }
  if (hasFrame) {
    html += F("<p>Live.</p>");
  } else {
    html += F("<section><h2>Next step</h2><p>Open <a href='");
    html += kCustomerAppUrl;
    html += F("'>");
    html += kCustomerAppHost;
    html += F("</a> on your Mac and follow the main button.</p></section>");
  }
  html += F("<p><a href='/health'>Status</a> <a href='/update'>Update</a></p>");
  const String tokenQuery = deviceAuthConfigured() ? String("?token=") + deviceAuthToken : String();
  if (renderer.SupportsBrightnessControl()) {
    html += F("<section><form method='post' action='/api/settings");
    html += tokenQuery;
    html += F("'><label>Bright</label><input name='b' type='range' min='10' max='100' value='");
    html += String(deviceSettings.brightnessPercent);
    html += F("'><button>OK</button></form></section>");
  }
  html += F("<section><h2>Pairing</h2>");
  if (deviceAuthConfigured()) {
    html += F("<p>Token</p><code>");
    html += htmlEscape(deviceAuthToken);
    html += F("</code><p class='muted'>Use this only when support asks for a pairing token.</p>");
    html += F("<form method='post' action='/api/pair'><button>Rotate token</button></form>");
  } else {
    html += F("<p class='muted'>Create a token before exposing theme controls to other devices on your network.</p>");
    html += F("<form method='post' action='/api/pair'><button>Create token</button></form>");
  }
  html += F("</section>");
  html += F("<form method='post' action='/reset-wifi' onsubmit=\"return confirm('Clear WiFi settings and restart setup?')\"><button>Reset WiFi</button></form>");
  return html;
}

void handleRoot() {
  webServer.keepAlive(false);
  if (setupMode) {
    codexbar_display::esp8266::wifi_setup::SendSetupPage(
        webServer,
        setupWifiState,
        kWifiTroubleshootingUrl,
        kSetupAddress);
    return;
  }
  webServer.send(200, "text/html; charset=utf-8", connectedPageHTML());
}

void redirectToSetupRoot() {
  webServer.keepAlive(false);
  webServer.sendHeader("Location", String("http://") + kSetupAddress + "/", true);
  webServer.send(302, "text/plain; charset=utf-8", "");
}

