DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
void handleCaptivePortalProbe() {
  webServer.keepAlive(false);
  if (setupMode) {
    codexbar_display::esp8266::wifi_setup::SendSetupPage(
        webServer,
        setupWifiState,
        kWifiTroubleshootingUrl,
        kSetupAddress);
    return;
  }
  redirectToSetupRoot();
}

void handleSaveWifi() {
  webServer.keepAlive(false);
  String ssid = webServer.arg("custom_ssid");
  ssid.trim();
  if (ssid.length() == 0) {
    ssid = webServer.arg("ssid");
    ssid.trim();
  }
  String password = webServer.arg("password");
  if (ssid.length() == 0) {
    codexbar_display::esp8266::wifi_setup::SetConnectionError(
        setupWifiState,
        codexbar_display::esp8266::wifi_setup::ConnectionError::MissingSsid);
    codexbar_display::esp8266::wifi_setup::SendSetupPage(
        webServer,
        setupWifiState,
        kWifiTroubleshootingUrl,
        kSetupAddress,
        400);
    return;
  }
  if (ssid.length() >= kWifiSsidBytes || password.length() >= kWifiPasswordBytes) {
    codexbar_display::esp8266::wifi_setup::SetConnectionError(
        setupWifiState,
        codexbar_display::esp8266::wifi_setup::ConnectionError::InvalidCredentials,
        ssid);
    codexbar_display::esp8266::wifi_setup::SendSetupPage(
        webServer,
        setupWifiState,
        kWifiTroubleshootingUrl,
        kSetupAddress,
        400);
    return;
  }

  codexbar_display::esp8266::wifi_setup::ClearConnectionError(setupWifiState);
  saveWifiCredentials(ssid, password);
  Serial.printf("wifi_credentials_saved ssid=%s\n", ssid.c_str());
  webServer.send(200, "text/html; charset=utf-8", "<!doctype html><p>Saved. Vibe TV is restarting.</p>");
  delay(500);
  ESP.restart();
}

void handleSetupWifiScan() {
  webServer.keepAlive(false);
  if (!setupMode) {
    redirectToSetupRoot();
    return;
  }

  codexbar_display::esp8266::wifi_setup::ClearConnectionError(setupWifiState);
  scanSetupNetworks();
  webServer.sendHeader("Location", "/", true);
  webServer.send(303, "text/plain; charset=utf-8", "");
}

void handleResetWifi() {
  webServer.keepAlive(false);
  if (webServer.method() != HTTP_POST) {
    webServer.send(405, "text/plain; charset=utf-8", "method not allowed");
    return;
  }

  webServer.send(200, "text/html; charset=utf-8", "<!doctype html><p>WiFi settings cleared. Vibe TV is restarting setup.</p>");
  drawWifiResetStatus("Restarting");
  waitStatusRendered = true;
  delay(500);
  clearWifiCredentials();
  clearSdkWifiCredentials();
  clearBootRecoveryCounter();
  delay(250);
  ESP.restart();
}

void addCorsHeaders() {
  webServer.keepAlive(false);
  webServer.sendHeader("Access-Control-Allow-Origin", "*");
  webServer.sendHeader("Access-Control-Allow-Methods", "GET,POST,DELETE,OPTIONS");
  webServer.sendHeader("Access-Control-Allow-Headers", String("Content-Type,") + kDeviceAuthHeader);
}

void handleHello() {
  addCorsHeaders();
  if (requestAuthToken().length() > 0 && !requireWriteAuth()) {
    return;
  }

  String out;
  out.reserve(620);
  out += "{\"kind\":\"hello\",\"protocolVersion\":2,\"board\":\"";
  out += CODEXBAR_DISPLAY_BOARD_ID;
  out += "\",\"deviceId\":\"";
  out += ESP.getChipId();
  out += "\",\"networkMode\":\"";
  out += setupMode ? "setup" : "station";
  out += "\",\"firmware\":\"";
  out += CODEXBAR_DISPLAY_FW_VERSION;
  out += "\",\"maxFrameBytes\":";
  out += String(kMaxFrameBytes);
  out += ",\"capabilities\":{\"display\":{\"brightness\":";
  out += renderer.SupportsBrightnessControl() ? "{\"supported\":true}" : "{\"supported\":false}";
  out += "},\"theme\":";
#ifdef CODEXBAR_DISPLAY_PROBE_ONLY
  out += themeCapabilitiesJSON(false, true);
#else
#if CODEXBAR_DISPLAY_THEME_SPEC_RENDERER
  out += themeCapabilitiesJSON(true, true);
#else
  out += themeCapabilitiesJSON(false, true);
#endif
#endif
  out += ",\"transport\":{\"active\":\"wifi\"}}}";
  webServer.send(200, "application/json", out);
}

bool isSafeAssetPath(const String& path) {
  if (path.length() == 0 || path.length() >= kMaxAssetPathBytes || path.charAt(0) != '/') {
    return false;
  }
  if (path.indexOf("..") >= 0 || path.indexOf("//") >= 0) {
    return false;
  }
  if (path.endsWith("/")) {
    return false;
  }
  for (size_t i = 0; i < path.length(); ++i) {
    const char c = path.charAt(i);
    const bool ok =
        (c >= 'a' && c <= 'z') ||
        (c >= 'A' && c <= 'Z') ||
        (c >= '0' && c <= '9') ||
        c == '/' || c == '-' || c == '_' || c == '.';
    if (!ok) {
      return false;
    }
  }
  return true;
}

bool ensureAssetParentDirs(const String& path) {
  int slash = path.indexOf('/', 1);
  while (slash > 0) {
    const String dir = path.substring(0, slash);
    if (dir.length() > 1 && !LittleFS.exists(dir)) {
      if (!LittleFS.mkdir(dir)) {
        return false;
      }
    }
    slash = path.indexOf('/', slash + 1);
  }
  return true;
}

bool filesystemInfoJSON(String& out) {
  const bool mounted = LittleFS.begin();

  out += "\"filesystem\":{\"mounted\":";
  out += mounted ? "true" : "false";
  out += "}";
  return mounted;
}

String normalizedAssetListPath(const String& dirPath, const String& fileName) {
  if (fileName.startsWith("/")) {
    if (dirPath.length() > 1 && !fileName.startsWith(dirPath + "/")) {
      return dirPath + fileName;
    }
    return fileName;
  }
  if (dirPath.length() > 1) {
    return dirPath + "/" + fileName;
  }
  return "/" + fileName;
}

void appendAssetEntriesJSON(String& out, const String& dirPath, bool& first, String& seen, uint8_t depth) {
  if (depth > 4) {
    return;
  }
  Dir dir = LittleFS.openDir(dirPath);
  while (dir.next()) {
    const String path = normalizedAssetListPath(dirPath, dir.fileName());
    if (dir.isDirectory()) {
      appendAssetEntriesJSON(out, path, first, seen, depth + 1);
      continue;
    }
    const String seenToken = "|" + path + "|";
    if (seen.indexOf(seenToken) >= 0) {
      continue;
    }
    seen += seenToken;
    if (!first) {
      out += ",";
    }
    first = false;
    out += "{\"path\":\"";
    out += jsonEscape(path);
    out += "\",\"sizeBytes\":";
    out += String(dir.fileSize());
    out += "}";
  }
}

void appendAssetListJSON(String& out) {
  out += "\"assets\":[";
  bool first = true;
  if (LittleFS.begin()) {
    String seen;
    appendAssetEntriesJSON(out, "/", first, seen, 0);
    appendAssetEntriesJSON(out, "/themes", first, seen, 0);
    appendAssetEntriesJSON(out, "/themes/u", first, seen, 0);
    appendAssetEntriesJSON(out, "/themes/mini", first, seen, 0);
  }
  out += "]";
}

