DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
void handleHealth() {
  const codexbar_display::esp8266::RendererHealthSnapshot snapshot = renderer.HealthSnapshot();

  String out;
  out.reserve(896);
  out += "{\"ok\":true,\"firmware\":\"";
  out += jsonEscape(CODEXBAR_DISPLAY_FW_VERSION);
  out += "\",\"system\":{\"freeHeap\":";
  out += String(ESP.getFreeHeap());
  out += ",\"maxFreeBlock\":";
  out += String(ESP.getMaxFreeBlockSize());
  out += ",\"heapFragmentationPercent\":";
  out += String(ESP.getHeapFragmentation());
  out += ",\"bootId\":\"";
  out += jsonEscape(bootID);
  out += "\",\"uptimeMs\":";
  out += String(millis());
  out += ",\"resetCount\":";
  out += String(bootResetCounter);
  out += ",\"resetReason\":";
  out += bootResetReasonJSON;
  out += "},";
  const bool filesystemMounted = filesystemInfoJSON(out);
  out += ",\"display\":{\"activeTheme\":\"";
  out += jsonEscape(snapshot.activeTheme);
  out += "\",\"themeSpec\":{\"active\":";
  out += snapshot.themeSpecActive ? "true" : "false";
  out += ",\"path\":";
  appendJSONNullableString(out, activeThemeSpecPath);
  out += ",\"hash\":";
  appendJSONNullableString(out, activeThemeSpecHash);
  out += ",\"renderOk\":";
  out += snapshot.themeSpecRenderOk ? "true" : "false";
  out += ",\"renderError\":";
  appendJSONNullableString(out, snapshot.themeSpecRenderError);
  out += ",\"renderFailures\":";
  out += String(snapshot.themeSpecRenderFailures);
  out += ",\"cbaCompletedFrames\":";
  out += String(snapshot.cbaCompletedFrames);
  out += ",\"cbaLastFrameDurationMs\":";
  out += String(snapshot.cbaLastFrameDurationMs);
  out += ",\"cbaBufferBytes\":";
  out += String(snapshot.cbaBufferBytes);
  out += ",\"cbaBufferAllocationFailures\":";
  out += String(snapshot.cbaBufferAllocationFailures);
  out += ",\"cbaLastPushDurationUs\":";
  out += String(snapshot.cbaLastPushDurationUs);
  out += "},\"gif\":{\"activePath\":\"";
  out += jsonEscape(snapshot.gifActivePath);
  out += "\",\"filePresent\":";
  out += snapshot.gifFilePresent ? "true" : "false";
  out += ",\"decoderAllocated\":";
  out += snapshot.gifDecoderAllocated ? "true" : "false";
  out += ",\"decoderOpen\":";
  out += snapshot.gifDecoderOpen ? "true" : "false";
  out += ",\"lastError\":";
  appendJSONNullableString(out, snapshot.gifLastErrorStage);
  out += "}},\"render\":{\"fullCount\":";
  out += String(renderDiagnostics.fullCount);
  out += ",\"partialCount\":";
  out += String(renderDiagnostics.partialCount);
  out += ",\"lastKind\":\"";
  out += jsonEscape(renderDiagnostics.lastKind);
  out += "\"},";
  appendSettingsJSON(out);
  out += "}";

  (void)filesystemMounted;
  addCorsHeaders();
  webServer.send(200, "application/json", out);
}

bool persistDeviceSettings(const DeviceSettings& next) {
  const DeviceSettings previous = deviceSettings;
  deviceSettings = next;
  if (!saveDeviceSettings()) {
    deviceSettings = previous;
    applyDeviceSettings();
    return false;
  }
  applyDeviceSettings();
  return true;
}

void handleSettingsAPI() {
  addCorsHeaders();
  if (!requireWriteAuth()) {
    return;
  }
  DeviceSettings next = deviceSettings;
  const bool apiResponse = webServer.hasArg("api");
  if (webServer.hasArg("b")) {
    next.brightnessPercent = clampBrightnessPercent(webServer.arg("b").toInt());
  } else {
    webServer.send(400, "text/plain; charset=utf-8", "bad");
    return;
  }
  if (!persistDeviceSettings(next)) {
    webServer.send(500, "text/plain; charset=utf-8", "save failed");
    return;
  }
  if (!apiResponse && webServer.hasArg("b")) {
    webServer.sendHeader("Location", "/");
    webServer.send(303);
    return;
  }
  String out;
  out.reserve(80);
  out += "{\"ok\":true,";
  appendSettingsJSON(out);
  out += "}";
  webServer.send(200, "application/json", out);
}

void handlePairingAPI() {
  addCorsHeaders();
  const String token = generateAuthToken();
  if (!saveDeviceAuthToken(token)) {
    webServer.send(500, "text/plain; charset=utf-8", "pairing token save failed");
    return;
  }
  if (webServer.hasArg("api")) {
    String out;
    out.reserve(100);
    out += "{\"ok\":true,\"token\":\"";
    out += jsonEscape(token);
    out += "\"}";
    webServer.send(200, "application/json", out);
    return;
  }
  webServer.sendHeader("Location", "/");
  webServer.send(303);
}

void handleAssetsList() {
  String out;
  out.reserve(1200);
  out += "{";
  (void)filesystemInfoJSON(out);
  out += ",";
  appendAssetListJSON(out);
  out += "}";
  addCorsHeaders();
  webServer.send(200, "application/json", out);
}

void setAssetUploadError(const String& message) {
  if (assetUploadFile) {
    assetUploadFile.close();
  }
  if (assetUploadError.length() > 0) {
    return;
  }
  assetUploadError = message;
  Serial.printf("asset_upload_error path=%s message=%s\n", assetUploadPath.c_str(), assetUploadError.c_str());
}

void finishAssetUploadRequest() {
  if (assetUploadFile) {
    assetUploadFile.close();
  }
  markBootRecoveryUploadActive(false);
  assetUploadInProgress = false;
}

bool assetPathLooksGif(const String& path);

void discardPartialAssetUpload() {
  if (!LittleFS.begin() || !LittleFS.exists(kAssetUploadTemporaryPath)) {
    return;
  }
  if (LittleFS.remove(kAssetUploadTemporaryPath)) {
    Serial.printf("asset_upload_discarded path=%s\n", assetUploadPath.c_str());
  }
}

bool validateCompletedAssetUpload() {
  if (!assetPathLooksGif(assetUploadPath)) {
    return true;
  }
  codexbar_display::esp8266::GifValidationInfo info;
  const codexbar_display::esp8266::GifValidationError error =
      codexbar_display::esp8266::ValidateGifAssetFile(
          kAssetUploadTemporaryPath,
          codexbar_display::esp8266::kMaxThemeGifLzwBits,
          &info);
  if (error == codexbar_display::esp8266::GifValidationError::None) {
    return true;
  }
  setAssetUploadError(
      error == codexbar_display::esp8266::GifValidationError::LzwCodeSizeExceeded
          ? "gif requires unsupported LZW width"
          : "invalid gif");
  return false;
}

bool promoteCompletedAssetUpload() {
  // LittleFS rename is atomic and replaces an existing destination only after
  // the temporary file has been fully written and, for GIFs, validated.
  if (!LittleFS.rename(kAssetUploadTemporaryPath, assetUploadPath)) {
    setAssetUploadError("commit asset failed");
    return false;
  }
  return true;
}

String requestedAssetPath() {
  String path = webServer.arg("path");
  path.trim();
  if (path.length() == 0) {
    path = webServer.upload().filename;
    path.trim();
    const int lastSlash = path.lastIndexOf('/');
    if (lastSlash >= 0) {
      path = path.substring(lastSlash + 1);
    }
    const int lastBackslash = path.lastIndexOf('\\');
    if (lastBackslash >= 0) {
      path = path.substring(lastBackslash + 1);
    }
    if (path.length() > 0 && !path.startsWith("/")) {
      path = "/" + path;
    }
  }
  return path;
}

bool assetPathLooksGif(const String& path) {
  String lower = path;
  lower.toLowerCase();
  return lower.endsWith(".gif");
}

bool assetUploadContentLengthWouldExceedLimits(const HTTPUpload& upload) {
  if (!assetPathLooksGif(assetUploadPath)) {
    return false;
  }
  return upload.contentLength > 0 && upload.contentLength > kMaxThemeGifAssetBytes;
}

bool assetUploadBytesWouldExceedLimits(size_t nextChunkSize) {
  if (!assetPathLooksGif(assetUploadPath)) {
    return false;
  }
  return assetUploadBytesSeen + nextChunkSize > kMaxThemeGifAssetBytes;
}

void enterAssetUploadSafeMode() {
  firmwareUpdateNoticeDirty = false;
  frameStaleStatusRendered = false;
  renderer.ResetGifStateForAssetUpdate();
  close_all_fs();
  WiFiUDP::stopAll();
  WiFi.setSleepMode(WIFI_NONE_SLEEP);
  ESP.wdtFeed();
}

