DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
void handleAssetUpload() {
  HTTPUpload& upload = webServer.upload();

  if (upload.status == UPLOAD_FILE_START) {
    assetUploadSucceeded = false;
    assetUploadInProgress = true;
    assetUploadError = "";
    assetUploadPath = requestedAssetPath();
    assetUploadBytesSeen = 0;
    Serial.printf("asset_upload_start path=%s filename=%s content_length=%zu\n", assetUploadPath.c_str(), upload.filename.c_str(), upload.contentLength);

    if (!requestHasValidAuth()) {
      setAssetUploadError("unauthorized");
      return;
    }
    if (!isSafeAssetPath(assetUploadPath)) {
      setAssetUploadError("invalid asset path");
      return;
    }
    if (assetUploadPath == kAssetUploadTemporaryPath) {
      setAssetUploadError("reserved asset path");
      return;
    }
    if (assetUploadContentLengthWouldExceedLimits(upload)) {
      setAssetUploadError("gif asset too large");
      return;
    }
    markBootRecoveryUploadActive(true);
    enterAssetUploadSafeMode();
    if (!LittleFS.begin()) {
      setAssetUploadError("filesystem mount failed");
      return;
    }
    if (!ensureAssetParentDirs(assetUploadPath)) {
      setAssetUploadError("create parent directory failed");
      return;
    }
    if (LittleFS.exists(kAssetUploadTemporaryPath) && !LittleFS.remove(kAssetUploadTemporaryPath)) {
      setAssetUploadError("remove stale upload failed");
      return;
    }
    assetUploadFile = LittleFS.open(kAssetUploadTemporaryPath, "w");
    if (!assetUploadFile) {
      setAssetUploadError("open asset failed");
      return;
    }
  } else if (upload.status == UPLOAD_FILE_WRITE) {
    if (assetUploadError.length() > 0) {
      return;
    }
    if (assetUploadBytesWouldExceedLimits(upload.currentSize)) {
      setAssetUploadError("gif asset too large");
      yield();
      return;
    }
    if (!assetUploadFile) {
      setAssetUploadError("append asset failed");
      return;
    }
    if (assetUploadFile.write(upload.buf, upload.currentSize) != upload.currentSize) {
      setAssetUploadError("write asset failed");
    }
    assetUploadBytesSeen += upload.currentSize;
    ESP.wdtFeed();
  } else if (upload.status == UPLOAD_FILE_END) {
    if (assetUploadFile) {
      assetUploadFile.flush();
      assetUploadFile.close();
    }
    if (assetUploadError.length() == 0 &&
        validateCompletedAssetUpload() &&
        promoteCompletedAssetUpload()) {
      assetUploadSucceeded = true;
      Serial.printf("asset_upload_success path=%s bytes=%zu\n", assetUploadPath.c_str(), upload.totalSize);
    }
  } else if (upload.status == UPLOAD_FILE_ABORTED) {
    setAssetUploadError("upload aborted");
    finishAssetUploadRequest();
  }
  yield();
}

void handleAssetUploadResult() {
  if (assetUploadError == "unauthorized") {
    finishAssetUploadRequest();
    addCorsHeaders();
    webServer.sendHeader("WWW-Authenticate", "VibeTV token");
    webServer.send(401, "text/plain; charset=utf-8", "pairing token required");
    return;
  }
  if (!assetUploadSucceeded || assetUploadError.length() > 0) {
    const String error = assetUploadError.length() > 0 ? assetUploadError : "upload failed";
    discardPartialAssetUpload();
    finishAssetUploadRequest();
    addCorsHeaders();
    webServer.send(400, "text/plain; charset=utf-8", error);
    return;
  }

  String out;
  out.reserve(120);
  out += "{\"ok\":true,\"path\":\"";
  out += jsonEscape(assetUploadPath);
  out += "\"}";
  finishAssetUploadRequest();
  addCorsHeaders();
  webServer.send(200, "application/json", out);
}

void handleAssetDelete() {
  if (!requireWriteAuth()) {
    return;
  }
  String path = webServer.arg("path");
  path.trim();
  if (!isSafeAssetPath(path)) {
    addCorsHeaders();
    webServer.send(400, "text/plain; charset=utf-8", "invalid asset path");
    return;
  }
  if (!LittleFS.begin()) {
    addCorsHeaders();
    webServer.send(500, "text/plain; charset=utf-8", "filesystem mount failed");
    return;
  }
  if (!LittleFS.exists(path)) {
    addCorsHeaders();
    webServer.send(404, "text/plain; charset=utf-8", "asset not found");
    return;
  }
  if (path == activeThemeSpecPath) {
    addCorsHeaders();
    webServer.send(409, "text/plain; charset=utf-8", "asset is active");
    return;
  }
  renderer.ResetGifStateForAssetUpdate();
  if (!LittleFS.remove(path)) {
    addCorsHeaders();
    webServer.send(500, "text/plain; charset=utf-8", "asset delete failed");
    return;
  }
  Serial.printf("asset_deleted path=%s\n", path.c_str());
  addCorsHeaders();
  webServer.send(200, "application/json", "{\"ok\":true}");
}

#if CODEXBAR_DISPLAY_THEME_SPEC_RENDERER
bool readActiveThemeSpecPath(String& path) {
  path = "";
  if (!LittleFS.begin() || !LittleFS.exists(kActiveThemeSpecPathFile)) {
    return false;
  }
  File file = LittleFS.open(kActiveThemeSpecPathFile, "r");
  if (!file) {
    return false;
  }
  path = file.readString();
  file.close();
  path.trim();
  return isSafeAssetPath(path) && path.startsWith("/themes/");
}

bool saveActiveThemeSpecPath(const String& path) {
  if (!isSafeAssetPath(path) || !path.startsWith("/themes/")) {
    return false;
  }
  if (!LittleFS.begin()) {
    return false;
  }
  File file = LittleFS.open(kActiveThemeSpecPathFile, "w");
  if (!file) {
    return false;
  }
  const size_t written = file.print(path);
  file.close();
  return written == path.length();
}

bool readStoredThemeSpec(const String& path, String& raw, String& error) {
  if (!isSafeAssetPath(path) || !path.startsWith("/themes/")) {
    error = "invalid theme path";
    return false;
  }
  if (!LittleFS.begin()) {
    error = "filesystem mount failed";
    return false;
  }
  if (!LittleFS.exists(path)) {
    error = "theme file not found";
    return false;
  }

  File file = LittleFS.open(path, "r");
  if (!file) {
    error = "open theme file failed";
    return false;
  }
  const size_t size = file.size();
  if (size == 0 || size > kMaxStoredThemeSpecBytes) {
    file.close();
    error = "theme file too large";
    return false;
  }
  raw = file.readString();
  file.close();
  raw.trim();

  // Firmware OTA intentionally preserves LittleFS. Devices upgraded from 1.0.36
  // therefore keep this known factory Mini spec, whose labels were hard-coded
  // to "left". Upgrade only that immutable legacy path in memory so the live
  // usage mode is rendered without rewriting customer storage during OTA.
  if (path == kLegacyDefaultThemeSpecPath) {
    raw.replace("\"v\":\"left\"", "\"v\":\"{usageMode}\"");
  }
  if (raw.length() == 0 || raw.length() > kMaxStoredThemeSpecBytes) {
    error = "theme file too large";
    return false;
  }
  return true;
}

bool themeSpecMetadata(const String& raw, String& themeId, int& themeRev, String& error) {
  JsonDocument filter;
  filter["themeId"] = true;
  filter["id"] = true;
  filter["themeRev"] = true;
  filter["rev"] = true;

  JsonDocument doc;
  const DeserializationError err = deserializeJson(doc, raw, DeserializationOption::Filter(filter));
  if (err) {
    error = String("bad theme json: ") + err.c_str();
    return false;
  }
  JsonObjectConst spec = doc.as<JsonObjectConst>();
  if (spec.isNull()) {
    error = "theme json must be an object";
    return false;
  }

