DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
  const char* id = nullptr;
  if (spec["themeId"].is<const char*>()) {
    id = spec["themeId"].as<const char*>();
  } else if (spec["id"].is<const char*>()) {
    id = spec["id"].as<const char*>();
  }
  if (id != nullptr) {
    themeId = String(id);
    themeId.trim();
  }
  themeRev = static_cast<int>(spec["themeRev"] | spec["rev"] | 0);
  if (themeId.length() == 0 || themeRev <= 0) {
    error = "theme id/rev missing";
    return false;
  }

  return true;
}

void activateStoredThemeSpec(const String& path, const String& raw, const String& themeId, int themeRev) {
  renderer.ResetGifStateForAssetUpdate();
  close_all_fs();

  const bool hadFrame = codexbar_display::app::HasFrame(runtimeCtx);
  const codexbar_display::core::Frame previous = runtimeCtx.runtime.current;
  codexbar_display::core::Frame next = hadFrame ? previous : codexbar_display::core::Frame{};

  next.hasError = false;
  next.error = "";
  next.clearThemeSpec = false;
  next.hasThemeSpec = true;
  next.themeSpecId = themeId;
  next.themeSpecRev = themeRev;
  next.themeSpecRaw = "";
  runtimeCtx.runtime.cachedThemeId = themeId;
  runtimeCtx.runtime.cachedThemeRev = themeRev;
  runtimeCtx.runtime.cachedThemeSpecRaw = raw;
  runtimeCtx.runtime.current = next;
  runtimeCtx.runtime.hasFrame = true;
  runtimeCtx.runtime.resetBaseSecs = next.resetSecs;
  runtimeCtx.runtime.resetBaseMillis = millis();
  activeThemeSpecPath = path;
  activeThemeSpecHash = hashHex8(raw);

  codexbar_display::core::SerialConsumeEvent event;
  event.frameAccepted = true;
  event.hadFrame = hadFrame;
  event.themeSpecChanged = true;
  event.visualChanged = !hadFrame || codexbar_display::core::FrameVisualChanged(previous, next) || event.themeSpecChanged;
  markFrameAccepted(event, "theme");
}

bool activateStoredThemePath(const String& path, String& themeId, int& themeRev, String& error) {
  String raw;
  if (!readStoredThemeSpec(path, raw, error)) {
    return false;
  }

  if (!themeSpecMetadata(raw, themeId, themeRev, error)) {
    return false;
  }
  if (!saveActiveThemeSpecPath(path)) {
    error = "save active theme failed";
    return false;
  }

  activateStoredThemeSpec(path, raw, themeId, themeRev);
  return true;
}

#endif

void handleThemeActive() {
#if CODEXBAR_DISPLAY_THEME_SPEC_RENDERER
  if (!requireWriteAuth()) {
    return;
  }
  const bool formMode = webServer.hasArg("path");
  String path = webServer.arg("path");
  if (!formMode) {
    String body = webServer.arg("plain");
    body.trim();
    if (body.length() == 0 || body.length() > 160) {
      addCorsHeaders();
      webServer.send(400, "text/plain; charset=utf-8", "invalid theme activation body");
      return;
    }

    JsonDocument doc;
    const DeserializationError err = deserializeJson(doc, body);
    if (err) {
      addCorsHeaders();
      webServer.send(400, "text/plain; charset=utf-8", "bad theme activation json");
      return;
    }
    path = String(doc["path"] | "");
  }
  path.trim();

  String themeId;
  int themeRev = 0;
  String error;
  if (!activateStoredThemePath(path, themeId, themeRev, error)) {
    addCorsHeaders();
    webServer.send(error == "theme file not found" ? 404 : 400, "text/plain; charset=utf-8", error);
    return;
  }

  if (formMode) {
    webServer.keepAlive(false);
    webServer.sendHeader("Location", "/");
    webServer.send(303);
    return;
  }

  String out;
  out.reserve(160);
  out += "{\"ok\":true,\"path\":\"";
  out += jsonEscape(path);
  out += "\",\"id\":\"";
  out += jsonEscape(themeId);
  out += "\",\"rev\":";
  out += String(themeRev);
  out += ",\"hash\":\"";
  out += jsonEscape(activeThemeSpecHash);
  out += "\"";
  out += "}";
  addCorsHeaders();
  webServer.send(200, "application/json", out);
#else
  addCorsHeaders();
  webServer.send(501, "text/plain; charset=utf-8", "theme spec renderer disabled");
#endif
}

#if CODEXBAR_DISPLAY_THEME_SPEC_RENDERER
bool loadStoredThemeSpecCacheFromPath(const String& path) {
  String error;
  String raw;
  if (!readStoredThemeSpec(path, raw, error)) {
    Serial.printf("theme_cache_load_failed path=%s err=%s\n", path.c_str(), error.c_str());
    return false;
  }

  String themeId;
  int themeRev = 0;
  if (!themeSpecMetadata(raw, themeId, themeRev, error)) {
    Serial.printf("theme_cache_load_failed path=%s err=%s\n", path.c_str(), error.c_str());
    return false;
  }

  runtimeCtx.runtime.cachedThemeId = themeId;
  runtimeCtx.runtime.cachedThemeRev = themeRev;
  runtimeCtx.runtime.cachedThemeSpecRaw = raw;
  activeThemeSpecPath = path;
  activeThemeSpecHash = hashHex8(raw);
  Serial.printf("theme_cache_loaded path=%s id=%s rev=%d\n", path.c_str(), themeId.c_str(), themeRev);
  return true;
}

void loadDefaultStoredThemeSpecCache() {
  String activePath;
  if (readActiveThemeSpecPath(activePath) && loadStoredThemeSpecCacheFromPath(activePath)) {
    return;
  }
  if (loadStoredThemeSpecCacheFromPath(kDefaultThemeSpecPath)) {
    runtimeCtx.runtime.cachedThemeId = kDefaultThemeSpecId;
    runtimeCtx.runtime.cachedThemeRev = kDefaultThemeSpecRev;
    return;
  }
  if (loadStoredThemeSpecCacheFromPath(kPreviousDefaultThemeSpecPath)) {
    runtimeCtx.runtime.cachedThemeId = kDefaultThemeSpecId;
    runtimeCtx.runtime.cachedThemeRev = kDefaultThemeSpecRev;
    return;
  }
  if (loadStoredThemeSpecCacheFromPath(kLegacyDefaultThemeSpecPath)) {
    runtimeCtx.runtime.cachedThemeId = kDefaultThemeSpecId;
    runtimeCtx.runtime.cachedThemeRev = kDefaultThemeSpecRev;
  }
}
#endif

String updatePageHTML() {
  const String installCommand = updateInstallCommand();
  const String tokenQuery = deviceAuthConfigured() ? String("?token=") + deviceAuthToken : String();
  String html;
  html.reserve(1600);
  html += F("<!doctype html><html><head><meta name='viewport' content='width=device-width,initial-scale=1'>");
  html += F("<title>VibeTV Update</title><style>");
  html += F(":root{color-scheme:dark}body{font-family:-apple-system,BlinkMacSystemFont,Segoe UI,sans-serif;margin:0;background:#0b0c0d;color:#f6f4ed}main{max-width:620px;margin:auto;padding:24px 18px}a,summary{color:#c7ff00;font-weight:800}h1{margin:16px 0}.muted{color:#a9adb3}.update,input,button,pre{border-radius:8px}.update{border:1px solid #6f8f00;padding:10px}.update-link{display:none}input,button{width:100%;font:inherit;padding:12px;margin-top:10px}button{background:#c7ff00;color:#111;border:0;font-weight:900}pre{white-space:pre-wrap;word-break:break-word;background:#08090a;border:1px solid #30343a;padding:12px}</style></head><body><main>");
  html += F("<h1>VibeTV Update</h1>");
  html += updateStatusHTML(false);
  html += F("<h2>Check with Mac</h2><p class='muted'>Copy this command into Terminal. It refreshes the Mac helper first, then installs firmware if needed.</p><pre id='cmd'>");
  html += htmlEscape(installCommand);
  html += F("</pre><textarea id='cmdFallback' readonly style='position:absolute;left:-9999px'></textarea><button type='button' onclick='copyCmd()' id='copyBtn'>Copy update command</button><details><summary>Manual upload</summary>");
  html += F("<form method='post' action='/update/firmware");
  html += tokenQuery;
  html += F("' enctype='multipart/form-data'>");
  html += F("<input type='file' name='firmware' accept='.bin,application/octet-stream' required>");
  html += F("<button type='submit'>Upload firmware</button></form>");
  html += F("</details>");
  html += F("<p class='muted'><a href='/'>Setup</a> | <a href='/health'>Status</a> | <a href='/assets'>Files</a></p>");
  html += F("<script>function copied(){document.getElementById('copyBtn').textContent='Copied';}function fallbackCopy(t){var a=document.getElementById('cmdFallback');a.value=t;a.focus();a.select();try{document.execCommand('copy');copied();}catch(e){window.prompt('Copy this command',t);}}function copyCmd(){var t=document.getElementById('cmd').textContent.trim();if(navigator.clipboard&&navigator.clipboard.writeText){navigator.clipboard.writeText(t).then(copied,function(){fallbackCopy(t);});}else{fallbackCopy(t);}}</script></main></body></html>");
  return html;
}

