DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
void handleUpdatePage() {
  webServer.keepAlive(false);
  webServer.send(200, "text/html; charset=utf-8", updatePageHTML());
}

void setOtaError(const String& message) {
  otaUploadError = message;
  otaDiagnostics.status = "failed";
  otaDiagnostics.lastError = message;
  otaDiagnostics.updateError = Update.getError();
  otaDiagnostics.endedAtMs = millis();
  Serial.printf("ota_error message=%s\n", otaUploadError.c_str());
  if (Update.hasError()) {
    Update.printError(Serial);
  }
}

void resetOtaUpdaterAfterFailure() {
  if (Update.isRunning()) {
    Update.end(false);
  }
  Update.clearError();
}

size_t otaMaxSizeForCommand(int command) {
  if (command == U_FS) {
    return static_cast<size_t>(FS_end - FS_start);
  }
  return static_cast<size_t>((ESP.getFreeSketchSpace() - 0x1000) & 0xFFFFF000);
}

void enterOtaSafeMode(int command, WiFiClient* otaClient) {
  (void)command;
  firmwareUpdateNoticeDirty = false;
  frameStaleStatusRendered = false;
  renderer.ResetGifStateForAssetUpdate();
  close_all_fs();
  WiFiUDP::stopAll();
  if (otaClient != nullptr) {
    WiFiClient::stopAllExcept(otaClient);
  } else {
    WiFiClient::stopAll();
  }
  WiFi.setSleepMode(WIFI_NONE_SLEEP);
  ESP.wdtFeed();
}

void handleOtaUpload(int command, const char* target) {
  HTTPUpload& upload = webServer.upload();

  if (upload.status == UPLOAD_FILE_START) {
    otaUploadSucceeded = false;
    otaUploadInProgress = true;
    otaUploadNeedsReboot = false;
    otaUploadError = "";
    const size_t maxSize = otaMaxSizeForCommand(command);
    otaDiagnostics.target = target;
    otaDiagnostics.status = "starting";
    otaDiagnostics.filename = upload.filename;
    otaDiagnostics.lastError = "";
    otaDiagnostics.command = command;
    otaDiagnostics.contentLength = upload.contentLength;
    otaDiagnostics.totalSize = 0;
    otaDiagnostics.maxSize = maxSize;
    otaDiagnostics.freeSketchSpace = ESP.getFreeSketchSpace();
    otaDiagnostics.updateError = UPDATE_ERROR_OK;
    otaDiagnostics.startedAtMs = millis();
    otaDiagnostics.endedAtMs = 0;
    Serial.printf(
        "ota_upload_start target=%s filename=%s content_length=%zu max_size=%zu free_sketch_space=%zu\n",
        target,
        upload.filename.c_str(),
        upload.contentLength,
        maxSize,
        otaDiagnostics.freeSketchSpace);
    if (!requestHasValidAuth()) {
      setOtaError("unauthorized");
      return;
    }
    markBootRecoveryUploadActive(true);
    enterOtaSafeMode(command, &webServer.client());
    otaUploadNeedsReboot = true;
    const String targetLabel = command == U_FS ? "Loading display" : "Loading firmware";
    drawUpdateStatus(targetLabel);
    waitStatusRendered = true;
    if (!Update.begin(maxSize, command)) {
      setOtaError(Update.getErrorString());
      resetOtaUpdaterAfterFailure();
    } else {
      otaDiagnostics.status = "writing";
    }
  } else if (upload.status == UPLOAD_FILE_WRITE) {
    otaDiagnostics.totalSize = upload.totalSize + upload.currentSize;
    if (otaUploadError.length() == 0 && Update.write(upload.buf, upload.currentSize) != upload.currentSize) {
      setOtaError(Update.getErrorString());
      resetOtaUpdaterAfterFailure();
    }
    ESP.wdtFeed();
  } else if (upload.status == UPLOAD_FILE_END) {
    otaDiagnostics.totalSize = upload.totalSize;
    if (otaUploadError.length() == 0 && Update.end(true)) {
      otaUploadSucceeded = true;
      otaDiagnostics.status = "succeeded";
      otaDiagnostics.updateError = UPDATE_ERROR_OK;
      otaDiagnostics.endedAtMs = millis();
      otaDiagnostics.successCount++;
      Serial.printf("ota_upload_success target=%s bytes=%zu\n", target, upload.totalSize);
    } else if (otaUploadError.length() == 0) {
      setOtaError(Update.getErrorString());
      resetOtaUpdaterAfterFailure();
    }
  } else if (upload.status == UPLOAD_FILE_ABORTED) {
    setOtaError("upload aborted");
    resetOtaUpdaterAfterFailure();
    otaDiagnostics.totalSize = upload.totalSize;
    Serial.printf("ota_upload_aborted target=%s bytes=%zu\n", target, upload.totalSize);
  }
  yield();
}

void scheduleReboot(const char* reason) {
  rebootPending = true;
  rebootAtMs = millis() + kRebootDelayMs;
  Serial.printf("reboot_scheduled reason=%s delay_ms=%lu\n", reason, kRebootDelayMs);
}

void handleOtaResult(const char* target) {
  webServer.keepAlive(false);
  if (otaUploadError == "unauthorized") {
    otaUploadInProgress = false;
    markBootRecoveryUploadActive(false);
    otaDiagnostics.status = "failed";
    otaDiagnostics.lastError = otaUploadError;
    otaDiagnostics.updateError = Update.getError();
    otaDiagnostics.endedAtMs = millis();
    otaDiagnostics.failureCount++;
    otaUploadNeedsReboot = false;
    addCorsHeaders();
    webServer.sendHeader("WWW-Authenticate", "VibeTV token");
    webServer.send(401, "text/plain; charset=utf-8", "pairing token required");
    return;
  }
  if (!otaUploadSucceeded || otaUploadError.length() > 0 || Update.hasError()) {
    otaUploadInProgress = false;
    markBootRecoveryUploadActive(false);
    const String error = otaUploadError.length() > 0 ? otaUploadError : Update.getErrorString();
    otaDiagnostics.status = "failed";
    otaDiagnostics.lastError = error;
    otaDiagnostics.updateError = Update.getError();
    otaDiagnostics.endedAtMs = millis();
    otaDiagnostics.failureCount++;
    Serial.printf("ota_upload_failed target=%s error=%s\n", target, error.c_str());
    webServer.send(500, "text/plain; charset=utf-8", "Update failed: " + error);
    if (otaUploadNeedsReboot) {
      scheduleReboot("ota_failure");
    }
    otaUploadNeedsReboot = false;
    return;
  }

  String html;
  html.reserve(500);
  html += "<!doctype html><html><head><meta name='viewport' content='width=device-width,initial-scale=1'>";
  html += "<title>VibeTV Update</title></head><body style='font-family:-apple-system,BlinkMacSystemFont,Segoe UI,sans-serif;margin:32px'>";
  html += "<h1>Update successful</h1><p>";
  html += target;
  html += " was written. Vibe TV is restarting.</p></body></html>";
  webServer.send(200, "text/html; charset=utf-8", html);
  drawUpdateStatus("Restarting");
  waitStatusRendered = true;
  otaDiagnostics.status = "reboot_scheduled";
  scheduleReboot(target);
  otaUploadInProgress = false;
  otaUploadNeedsReboot = false;
}

void sendRawOtaResponse(WiFiClient& client, int status, const char* statusText, const String& body) {
  client.print("HTTP/1.1 ");
  client.print(status);
  client.print(" ");
  client.print(statusText);
  client.print("\r\nConnection: close\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Length: ");
  client.print(body.length());
  client.print("\r\n\r\n");
  client.print(body);
}

bool rawRequestLineIsFirmwarePost(const String& line) {
  return line.startsWith("POST /update/firmware.raw ") ||
         line.startsWith("POST /update/firmware.raw?") ||
         line.startsWith("PUT /update/firmware.raw ") ||
         line.startsWith("PUT /update/firmware.raw?");
}

String rawRequestToken(const String& line) {
  const int queryStart = line.indexOf("?token=");
  if (queryStart < 0) {
    return "";
  }
  int tokenStart = queryStart + 7;
  int tokenEnd = line.indexOf(' ', tokenStart);
  const int nextParam = line.indexOf('&', tokenStart);
  if (nextParam >= 0 && (tokenEnd < 0 || nextParam < tokenEnd)) {
    tokenEnd = nextParam;
  }
  if (tokenEnd < 0) {
    tokenEnd = line.length();
  }
  String token = line.substring(tokenStart, tokenEnd);
  token.trim();
  return token;
}

void handleRawOtaClient() {
  if (!rawOtaServerStarted || otaUploadInProgress || rebootPending) {
    return;
  }

  WiFiClient client = rawOtaServer.accept();
  if (!client) {
    return;
  }
  client.setTimeout(5000);

  String requestLine = client.readStringUntil('\n');
  requestLine.trim();
  if (!rawRequestLineIsFirmwarePost(requestLine)) {
    sendRawOtaResponse(client, 404, "Not Found", "not found");
    client.stop();
    return;
  }

