DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
  String rawToken = rawRequestToken(requestLine);
  size_t contentLength = 0;
  while (client.connected()) {
    String header = client.readStringUntil('\n');
    header.trim();
    if (header.length() == 0) {
      break;
    }
    String lower = header;
    lower.toLowerCase();
    if (lower.startsWith("content-length:")) {
      String value = header.substring(header.indexOf(':') + 1);
      value.trim();
      contentLength = static_cast<size_t>(value.toInt());
    } else if (lower.startsWith("x-vibetv-token:")) {
      rawToken = header.substring(header.indexOf(':') + 1);
      rawToken.trim();
    }
  }

  if (deviceAuthConfigured() && rawToken != deviceAuthToken) {
    sendRawOtaResponse(client, 401, "Unauthorized", "pairing token required");
    client.stop();
    return;
  }

  if (contentLength == 0) {
    sendRawOtaResponse(client, 411, "Length Required", "content-length required");
    client.stop();
    return;
  }

  const size_t maxSize = otaMaxSizeForCommand(U_FLASH);
  if (contentLength > maxSize) {
    sendRawOtaResponse(client, 413, "Payload Too Large", "firmware image is too large");
    client.stop();
    return;
  }

  otaUploadSucceeded = false;
  otaUploadInProgress = true;
  otaUploadNeedsReboot = false;
  otaUploadError = "";
  otaDiagnostics.target = "firmware_raw";
  otaDiagnostics.status = "starting";
  otaDiagnostics.filename = "raw";
  otaDiagnostics.lastError = "";
  otaDiagnostics.command = U_FLASH;
  otaDiagnostics.contentLength = contentLength;
  otaDiagnostics.totalSize = 0;
  otaDiagnostics.maxSize = maxSize;
  otaDiagnostics.freeSketchSpace = ESP.getFreeSketchSpace();
  otaDiagnostics.updateError = UPDATE_ERROR_OK;
  otaDiagnostics.startedAtMs = millis();
  otaDiagnostics.endedAtMs = 0;

  markBootRecoveryUploadActive(true);
  enterOtaSafeMode(U_FLASH, &client);
  otaUploadNeedsReboot = true;
  drawUpdateStatus("Loading firmware");
  waitStatusRendered = true;

  if (!Update.begin(contentLength, U_FLASH)) {
    setOtaError(Update.getErrorString());
    resetOtaUpdaterAfterFailure();
  } else {
    otaDiagnostics.status = "writing";
  }

  uint8_t buffer[kRawOtaReadBufferBytes];
  size_t remaining = contentLength;
  unsigned long lastProgressMs = millis();
  while (remaining > 0 && otaUploadError.length() == 0) {
    const int available = client.available();
    if (available <= 0) {
      if (!client.connected()) {
        setOtaError("raw upload disconnected");
        resetOtaUpdaterAfterFailure();
        break;
      }
      if (millis() - lastProgressMs > kRawOtaProgressTimeoutMs) {
        setOtaError("raw upload timeout");
        resetOtaUpdaterAfterFailure();
        break;
      }
      delay(1);
      continue;
    }
    size_t want = static_cast<size_t>(available);
    if (want > remaining) {
      want = remaining;
    }
    if (want > sizeof(buffer)) {
      want = sizeof(buffer);
    }
    const int readCount = client.read(buffer, want);
    if (readCount <= 0) {
      delay(1);
      continue;
    }
    const size_t got = static_cast<size_t>(readCount);
    lastProgressMs = millis();
    remaining -= got;
    otaDiagnostics.totalSize += got;
    if (Update.write(buffer, got) != got) {
      setOtaError(Update.getErrorString());
      resetOtaUpdaterAfterFailure();
      break;
    }
    ESP.wdtFeed();
    delay(0);
  }

  if (otaUploadError.length() == 0 && remaining == 0 && Update.end(false)) {
    otaUploadSucceeded = true;
    otaDiagnostics.status = "succeeded";
    otaDiagnostics.updateError = UPDATE_ERROR_OK;
    otaDiagnostics.endedAtMs = millis();
    otaDiagnostics.successCount++;
    sendRawOtaResponse(client, 200, "OK", "ok");
    drawUpdateStatus("Restarting");
    waitStatusRendered = true;
    otaDiagnostics.status = "reboot_scheduled";
    scheduleReboot("firmware_raw");
    otaUploadNeedsReboot = false;
  } else {
    markBootRecoveryUploadActive(false);
    if (otaUploadError.length() == 0) {
      setOtaError(Update.getErrorString());
      resetOtaUpdaterAfterFailure();
    }
    otaDiagnostics.failureCount++;
    sendRawOtaResponse(client, 500, "Internal Server Error", "Update failed: " + otaUploadError);
    if (otaUploadNeedsReboot) {
      scheduleReboot("firmware_raw_failure");
    }
    otaUploadNeedsReboot = false;
  }
  otaUploadInProgress = false;
  client.stop();
}

void handleFrame() {
  if (!requireWriteAuth()) {
    return;
  }
  String rawBody = webServer.arg("plain");
  if (rawBody.length() == 0) {
    addCorsHeaders();
    webServer.send(400, "text/plain; charset=utf-8", "empty frame body");
    return;
  }
  if (rawBody.length() > kMaxFrameBytes) {
    addCorsHeaders();
    webServer.send(413, "text/plain; charset=utf-8", "frame body too large");
    return;
  }
  String body = rawBody;
  body.trim();
  if (body.length() == 0) {
    addCorsHeaders();
    webServer.send(400, "text/plain; charset=utf-8", "empty frame body");
    return;
  }
  if (body.indexOf('\n') >= 0 || body.indexOf('\r') >= 0) {
    addCorsHeaders();
    webServer.send(400, "text/plain; charset=utf-8", "expected one newline-delimited JSON frame");
    return;
  }

  codexbar_display::core::SerialConsumeEvent event;
  if (!codexbar_display::core::ConsumeFrameLine(runtimeCtx.runtime, body.c_str(), millis(), event) ||
      !event.frameAccepted) {
    addCorsHeaders();
    webServer.send(400, "text/plain; charset=utf-8", "frame was not accepted");
    return;
  }

  // Acknowledge before display work so a slow render cannot make the host retry
  // an already accepted frame.
  addCorsHeaders();
  webServer.send(200, "text/plain; charset=utf-8", "ok");
  markFrameAccepted(event, "wifi");
}

void startHttpServer() {
  if (httpServerStarted) {
    return;
  }
  webServer.on("/", HTTP_GET, handleRoot);
  webServer.on("/hotspot-detect.html", HTTP_GET, handleCaptivePortalProbe);
  webServer.on("/generate_204", HTTP_GET, handleCaptivePortalProbe);
  webServer.on("/gen_204", HTTP_GET, handleCaptivePortalProbe);
  webServer.on("/fwlink", HTTP_GET, handleCaptivePortalProbe);
  webServer.on("/connecttest.txt", HTTP_GET, handleCaptivePortalProbe);
  webServer.on("/ncsi.txt", HTTP_GET, handleCaptivePortalProbe);
  webServer.on("/save", HTTP_POST, handleSaveWifi);
  webServer.on("/scan", HTTP_POST, handleSetupWifiScan);
  webServer.on("/reset-wifi", HTTP_POST, handleResetWifi);
  webServer.on("/hello", HTTP_GET, handleHello);
  webServer.on("/health", HTTP_GET, handleHealth);
  webServer.on("/api/settings", HTTP_POST, handleSettingsAPI);
  webServer.on("/api/pair", HTTP_POST, handlePairingAPI);
  webServer.on("/assets", HTTP_GET, handleAssetsList);
  webServer.on(
      "/assets",
      HTTP_POST,
      handleAssetUploadResult,
      handleAssetUpload);
  webServer.on("/assets", HTTP_DELETE, handleAssetDelete);
  webServer.on("/theme/active", HTTP_POST, handleThemeActive);
  webServer.on("/frame", HTTP_POST, handleFrame);
  webServer.on("/update", HTTP_GET, handleUpdatePage);
  webServer.on(
      "/update/firmware",
      HTTP_POST,
      []() {
        handleOtaResult("firmware");
      },
      []() {
        handleOtaUpload(U_FLASH, "firmware");
      });
  webServer.on(
      "/update/filesystem",
      HTTP_POST,
      []() {
        handleOtaResult("filesystem");
      },
      []() {
        handleOtaUpload(U_FS, "filesystem");
      });
  webServer.onNotFound([]() {
    if (webServer.method() == HTTP_OPTIONS) {
      addCorsHeaders();
      webServer.send(204, "text/plain", "");
      return;
    }
    if (setupMode) {
      handleCaptivePortalProbe();
      return;
    }
    webServer.send(404, "text/plain; charset=utf-8", "not found");
  });
  webServer.collectHeaders(kDeviceAuthHeader);
  webServer.begin();
  httpServerStarted = true;
  rawOtaServer.begin();
  rawOtaServer.setNoDelay(true);
  rawOtaServerStarted = true;
  Serial.println("http_server_started port=80");
  Serial.println("raw_ota_server_started port=8081 path=/update/firmware.raw");
}

void startSetupAccessPoint() {
  setupMode = true;
  resetWifiReconnectState();
  WiFi.mode(WIFI_AP_STA);
  WiFi.softAP(kSetupApSsid);
  Serial.printf("wifi_setup_ap ssid=VibeTV-Setup ip=%s\n", WiFi.softAPIP().toString().c_str());
  scanSetupNetworks();
  dnsServer.start(kDnsPort, "*", WiFi.softAPIP());
  captiveDnsStarted = true;
  Serial.printf("captive_dns_started port=%u ip=%s\n", kDnsPort, WiFi.softAPIP().toString().c_str());
  const unsigned long renderStartUs = micros();
  renderer.DrawSetupInstructions(runtimeCtx, kSetupApSsid, WiFi.softAPIP().toString());
  recordRenderFull("setup", micros() - renderStartUs);
  waitStatusRendered = true;
  startHttpServer();
}

void maintainWifiConnection() {
  if (setupMode || rebootPending) {
    return;
  }
  if (WiFi.status() == WL_CONNECTED) {
    if (wifiDisconnectedAtMs != 0) {
      Serial.printf("wifi_reconnected ip=%s\n", WiFi.localIP().toString().c_str());
      drawWaitingForCompanionStatus();
    }
    resetWifiReconnectState();
    return;
  }

  const unsigned long nowMs = millis();
  if (wifiDisconnectedAtMs == 0) {
    wifiDisconnectedAtMs = nowMs;
    wifiReconnectAttemptAtMs = 0;
    Serial.printf("wifi_disconnected status=%d fallback_ms=%lu\n",
                  static_cast<int>(WiFi.status()),
                  kWifiReconnectFallbackMs);
  }

  if (!wifiReconnectStatusRendered) {
    const unsigned long renderStartUs = micros();
    renderer.DrawStatus(runtimeCtx, "VIBE TV", "Reconnecting WiFi", "Please wait");
    recordRenderFull("status", micros() - renderStartUs);
    wifiReconnectStatusRendered = true;
  }

  if (wifiReconnectAttemptAtMs == 0 || (nowMs - wifiReconnectAttemptAtMs) >= kWifiReconnectRetryMs) {
    wifiReconnectAttemptAtMs = nowMs;
    WiFi.reconnect();
    Serial.printf("wifi_reconnect_attempt status=%d elapsed_ms=%lu\n",
                  static_cast<int>(WiFi.status()),
                  nowMs - wifiDisconnectedAtMs);
  }

  if ((nowMs - wifiDisconnectedAtMs) >= kWifiReconnectFallbackMs) {
    Serial.println("wifi_reconnect_failed action=setup_ap");
    const unsigned long renderStartUs = micros();
    renderer.DrawStatus(runtimeCtx, "VIBE TV SETUP", "WiFi unavailable", "Starting setup");
    recordRenderFull("status", micros() - renderStartUs);
    delay(750);
    codexbar_display::esp8266::wifi_setup::SetConnectionError(
        setupWifiState,
        codexbar_display::esp8266::wifi_setup::ConnectionError::ConnectionFailed,
        WiFi.SSID());
    startSetupAccessPoint();
  }
}

