DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
#ifdef CODEXBAR_DISPLAY_RUNTIME_BENCH
struct RuntimeBenchWindow {
  unsigned long windowStartMs = 0;
  unsigned long loopCount = 0;
  unsigned long renderCount = 0;
  unsigned long loopCpuMaxUs = 0;
  unsigned long renderMaxUs = 0;
};

RuntimeBenchWindow benchWindow;

void recordBench(unsigned long loopStartUs, bool rendered, unsigned long renderUs) {
  const unsigned long nowMs = millis();
  if (benchWindow.windowStartMs == 0) {
    benchWindow.windowStartMs = nowMs;
  }

  const unsigned long loopCpuUs = micros() - loopStartUs;
  benchWindow.loopCount++;
  if (loopCpuUs > benchWindow.loopCpuMaxUs) {
    benchWindow.loopCpuMaxUs = loopCpuUs;
  }

  if (rendered) {
    benchWindow.renderCount++;
    if (renderUs > benchWindow.renderMaxUs) {
      benchWindow.renderMaxUs = renderUs;
    }
  }

  if (nowMs - benchWindow.windowStartMs >= 60000UL) {
    Serial.printf(
        "bench board=%s loops=%lu renders=%lu loop_cpu_us_max=%lu render_us_max=%lu\n",
        CODEXBAR_DISPLAY_BOARD_ID,
        benchWindow.loopCount,
        benchWindow.renderCount,
        benchWindow.loopCpuMaxUs,
        benchWindow.renderMaxUs);

    benchWindow = {};
    benchWindow.windowStartMs = nowMs;
  }
}
#endif

}  // namespace

void setup() {
  Serial.begin(115200);
  delay(200);
  bootResetReasonJSON = "\"";
  bootResetReasonJSON += jsonEscape(ESP.getResetReason());
  bootResetReasonJSON += "\"";
  bootResetCounter = incrementBootResetCounter();
  bootID = String(ESP.getChipId(), HEX);
  bootID += "-";
  bootID += String(bootResetCounter);
  bootID += "-";
  bootID += String(ESP.getCycleCount(), HEX);
  renderer.Setup(runtimeCtx);
  loadDeviceSettings();
  loadDeviceAuthToken();
#if CODEXBAR_DISPLAY_THEME_SPEC_RENDERER
  loadDefaultStoredThemeSpecCache();
#endif
  const unsigned long startupRenderStartUs = micros();
  renderer.DrawStatus(runtimeCtx, "VIBE TV", "Starting", "Please wait");
  recordRenderFull("status", micros() - startupRenderStartUs);
  const bool forceSetupMode = consumeBootRecoveryTrigger();

  codexbar_display::app::EmitDeviceHello(makeTransportConfig("usb"));

#ifdef CODEXBAR_DISPLAY_PROBE_ONLY
  Serial.println("codexbar_display_ready_probe");
#else
  Serial.println("codexbar_display_ready_display");
#endif

  WifiConnectAttempt failedAttempt;
  bool wifiConnected = false;
  if (!forceSetupMode) {
    WifiCredentials creds;
    if (readWifiCredentials(creds)) {
      const WifiConnectAttempt savedAttempt = connectToSavedWifi(creds);
      wifiConnected = savedAttempt.connected;
      if (savedAttempt.attempted && !savedAttempt.connected) {
        failedAttempt = savedAttempt;
      }
    }

    if (!wifiConnected) {
      const WifiConnectAttempt sdkAttempt = connectToSdkWifiConfig(failedAttempt.ssid);
      wifiConnected = sdkAttempt.connected;
      if (!failedAttempt.attempted && sdkAttempt.attempted && !sdkAttempt.connected) {
        failedAttempt = sdkAttempt;
      }
    }
  }

  if (wifiConnected) {
    setupMode = false;
    startHttpServer();
  } else {
    if (failedAttempt.attempted) {
      codexbar_display::esp8266::wifi_setup::SetConnectionError(
          setupWifiState,
          codexbar_display::esp8266::wifi_setup::ConnectionErrorFromWifiStatus(failedAttempt.status),
          failedAttempt.ssid);
    }
    startSetupAccessPoint();
  }
}

void loop() {
  const unsigned long loopStartUs = micros();
  bool rendered = false;
  unsigned long renderDurationUs = 0;

  if (pendingWifiRender) {
    const codexbar_display::core::SerialConsumeEvent event = pendingWifiRenderEvent;
    pendingWifiRender = false;
    renderAcceptedFrame(event);
  }

  codexbar_display::core::SerialConsumeEvent event;
  if (codexbar_display::app::ConsumeSerial(runtimeCtx, millis(), event)) {
    markFrameAccepted(event, "usb");
  }

  maintainWifiConnection();
  if (!otaUploadInProgress) {
    maintainFirmwareUpdateNotice();
  }

  if (otaUploadInProgress || assetUploadInProgress) {
    if (httpServerStarted) {
      webServer.handleClient();
    }
    delay(1);
    return;
  }

  if (!waitStatusRendered &&
      codexbar_display::app::HasFrame(runtimeCtx) &&
      !codexbar_display::app::CurrentFrame(runtimeCtx).hasError &&
      !runtimeCtx.screenDirty &&
      !frameStaleStatusRendered) {
    renderer.TickActive(runtimeCtx);
    recordAnimatedTickAttempt();
    const int64_t remain = codexbar_display::app::CurrentRemainingSecs(runtimeCtx, millis());
    if (remain != runtimeCtx.lastRenderedSecs) {
      const int64_t minuteBucket = remain / 60;
      if (minuteBucket != runtimeCtx.lastRenderedMinuteBucket) {
#ifdef CODEXBAR_DISPLAY_PROBE_ONLY
        runtimeCtx.screenDirty = true;
#else
        const unsigned long renderStartUs = micros();
        renderer.DrawReset(runtimeCtx, remain);
        drawFirmwareUpdateNotice();
        recordRenderPartial("reset", micros() - renderStartUs);
#endif
      } else {
        runtimeCtx.lastRenderedSecs = remain;
      }
    }
  }

  if (firmwareUpdateNoticeDirty &&
      !waitStatusRendered &&
      codexbar_display::app::HasFrame(runtimeCtx) &&
      !codexbar_display::app::CurrentFrame(runtimeCtx).hasError &&
      !runtimeCtx.screenDirty &&
      !frameStaleStatusRendered) {
    const unsigned long renderStartUs = micros();
    drawFirmwareUpdateNotice();
    rendered = true;
    renderDurationUs = micros() - renderStartUs;
    recordRenderPartial("update_notice", renderDurationUs);
  }

  if (!setupMode &&
      !waitStatusRendered &&
      codexbar_display::app::HasFrame(runtimeCtx) &&
      !codexbar_display::app::CurrentFrame(runtimeCtx).hasError &&
      !codexbar_display::app::CurrentFrame(runtimeCtx).hasThemeSpec &&
      !runtimeCtx.screenDirty &&
      !frameStaleStatusRendered &&
      lastFrameAcceptedAtMs > 0 &&
      (millis() - lastFrameAcceptedAtMs) > kFrameStaleWarningMs) {
    const unsigned long renderStartUs = micros();
    renderer.DrawStatus(runtimeCtx, "VIBE TV", "Open App", kCustomerAppHost);
    recordRenderFull("status", micros() - renderStartUs);
    frameStaleStatusRendered = true;
  }

